{
  "header": {
    "home": "Home",
    "about": "About Us",
    "institutes": "Academic Levels",
    "remote_learning": "Remote Learning",
    "contact": "Contact Us",
    "platform": "Platform",
    "principles": "Principles",
    "values": "Values",
    "vision": "Vision",
    "message": "Mission",
    "goals": "Goals"
  },
  "footer": {
    "important_links": "Important Links",
    "services": "Our Services",
    "resources": "Resources",
    "quick_links": "Quick Links",
    "home": "Home",
    "about_us": "About Us",
    "our_services": "Our Services",
    "terms_conditions": "Terms & Conditions",
    "privacy_policy": "Privacy Policy",
    "e_learning": "E-Learning",
    "training_courses": "Training Courses",
    "event_management": "Event Management",
    "academic_guidance": "Academic Guidance",
    "design_creativity": "Design & Creativity",
    "digital_library": "Digital Library",
    "scientific_journals": "Scientific Journals",
    "student_activities": "Student Activities",
    "labs_workshops": "Labs & Workshops",
    "support_center": "Support Center",
    "academic_calendar": "Academic Calendar",
    "e_services": "E-Services",
    "student_portal": "Student Portal",
    "faculty_members": "Faculty Members",
    "contact_us": "Contact Us",
    "copyright": "All Rights Reserved"
  },
  "schools": {
    "name": "Safwat Al Safwa International Schools",
    "address": "King Fahd Street",
    "location": "Riyadh, Saudi Arabia",
    "phone": "Phone:",
    "email": "Email:"
  },
  "language": {
    "arabic": "العربية",
    "english": "English"
  },
  "banner": {
    "title": "The Launchpad for Building the Future Generation",
    "description": "Safwat Al Safwa Schools are the true starting point for shaping students’ character — morally, academically, and professionally. We empower them to understand their community and reality with confidence and face future challenges with awareness and excellence. With extensive experience in teaching and curriculum development, we provide meaningful education that instills values and shapes the vision of a bright tomorrow.",
    "start_journey": "Start Your Journey to Excellence",
    "explore_programs": "Explore Our Programs",
    "why_choose_us": "Why Choose Us?",
    "research_funding": "Outstanding Scientific Activities",
    "academic_programs": "Modern Educational Programs",
    "open_day": "Open Day",
    "application_workshop": "Application Workshop",
    "international_students_meeting": "International Students Orientation",
    "register_now": "Register Now",
    "stats": {
      "research_funding_count": "350+",
      "academic_programs_count": "200+"
    },
    "dates": {
      "november_15": "November 15",
      "december_5": "December 5",
      "january_10": "January 10"
    }
  },
  "about": {
    "title": "Empowering Students to Shape a Confident Future",
    "description": "We believe that school is the true starting point for building a student's character—ethically, academically, and professionally—enabling them to understand their social environment and confidently face future challenges. With extensive experience in education and deep research in educational management and curriculum development, we established Safwat Al-Safwa International Schools as an educational beacon that combines academic and vocational learning with a strong focus on quality and innovation. We go beyond teaching beneficial knowledge; we develop strong personalities and shape a bright future built on solid values, ambitious vision, and realistic goals. We prepare students for success and positive contribution to their community—starting from the foundational elementary stage, progressing through the middle stage with broader applied sciences, and finally the high school stage where they are equipped with the keys to their future.",
    "years_excellence": "Years of Excellence",
    "students": "Students",
    "faculty_members": "Faculty Members",
    "director_name": "Prof. Dr. Ahmed Al-Aqili",
    "director_title": "School Director",
    "campus_alt": "School Campus",
    "mission": "Our Mission",
    "mission_text": "Providing integrated education that instills values, strengthens self-confidence, and develops students’ thinking and creative skills. We aim to create an inspiring learning environment that encourages continuous learning and fosters positive interaction among students, teachers, and the community.",
    "vision": "Our Vision",
    "vision_text": "To become a leading and inspiring model in private education in the Kingdom, combining academic excellence, personal development, and future-ready skills. We adopt the latest educational and technological methods to ensure modern and impactful learning.",
    "values": "Our Values",
    "values_text": "Excellence – Creativity – Responsibility – Cooperation – Integrity – Love of Learning – Respect for Others – Innovation – Teamwork – Community Service"
  },
  "benefits": {
    "topTitle": "Benefits of Studying",
    "title": "at Safwat Al-Safwa International Schools",
    "description": "We provide a holistic education that develops students’ character, strengthens their academic and social skills, instills strong values and ethics, and inspires creativity, excellence, and teamwork—preparing them for a successful future.",
    "useful_education": "Practical and Valuable Education",
    "useful_education_text": "Providing practical and meaningful education that enables students to succeed academically and professionally, preparing them to face future challenges.",
    "self_development": "Self-Development and Leadership Skills",
    "self_development_text": "Enhancing self-confidence, fostering critical and creative thinking, and teaching effective communication and teamwork skills.",
    "international_certificate": "Internationally Recognized Certificates",
    "international_certificate_text": "Obtaining internationally recognized certificates that open wide opportunities for work and study locally and globally.",
    "job_opportunities": "Outstanding Future Opportunities",
    "job_opportunities_text": "Facilitating access to distinguished job opportunities in both the public and private sectors, locally and internationally.",
    "community_contribution": "Contributing to the Community",
    "community_contribution_text": "Cultivating a sense of social responsibility through student and graduate participation in community projects and initiatives.",
    "continuous_education": "Continuous Education",
    "continuous_education_text": "Providing continuous education programs for students and community members to keep pace with scientific and knowledge developments."
  },
  "contact": {
    "university_address": "Schools Address",
    "university_location": "Riyadh, Saudi Arabia",
    "university_name": "Safwat Al Safwa International Schools",
    "email": "Email",
    "social_media": "Social Media",
    "working_hours": "Working Hours",
    "work_days": "Sunday - Thursday: 8:00 AM - 4:00 PM",
    "weekend": "Friday - Saturday: Closed",
    "contact_us": "Contact Us",
    "contact_us_description": "We are here to help you with any inquiry or request",
    "first_name": "First Name",
    "email_placeholder": "Email Address",
    "subject": "Subject",
    "message_placeholder": "Write your message here...",
    "send_message": "Send Message"
  },
  "scholarships": {
    "title": "Scholarships",
    "description": "We offer scholarships for academically outstanding students and talented learners across different grade levels to support their success and growth.",
    "learn_more": "Learn More",
    "virtual_tour": "Virtual Tour",
    "academic_scholarship": "Academic Excellence Scholarships",
    "talent_scholarship": "Talent and Skills Scholarships",
    "academic_count": "Scholarships Annually",
    "talent_count": "Supported Talented Students"
  },
  "degrees": {
    "title": "Certificates Awarded by the Schools",
    "description": "Safwat Al-Safwa International Schools award the following certificates:",
    "diploma": "Progress Certificate",
    "diploma_subtitle": "Certificate of Advancement to the Next Grade",
    "diploma_description": "A certificate confirming that the student has progressed to the next grade",
    "elementary": "Elementary Certificate",
    "elementary_subtitle": "Elementary School Completion Certificate",
    "elementary_description": "A certificate that qualifies the student to enter the intermediate stage",
    "intermediate": "Intermediate Certificate",
    "intermediate_subtitle": "Intermediate School Completion Certificate",
    "intermediate_description": "A certificate that qualifies the student to enter the secondary stage",
    "secondary": "Secondary Certificate",
    "secondary_subtitle": "Secondary School Completion Certificate",
    "secondary_description": "A certificate that qualifies the student to join university or the job market",
    "excellence": "Academic Excellence Certificate",
    "excellence_subtitle": "For Outstanding Academic Students",
    "excellence_description": "Awarded to students with distinguished academic achievement",
    "achievement": "Achievement Certificate",
    "achievement_subtitle": "For Talented and Outstanding Students",
    "achievement_description": "Awarded to students who excel in various activities and talents"
  },
  "example_card": {
    "university_name_ar": "مدارس صفوت الصفوة الدولية",
    "university_name_en": "Safwat Al-Safwa International Schools",
    "welcome_text": "Welcome to Safwat Al-Safwa International Schools, where we strive to provide distinguished education that meets the needs of students in the 21st century.",
    "learn_more": "Learn About Us",
    "contact_us": "Contact Us",
    "last_update": "Last Updated: December 2024"
  },
  "featured_programs": {
    "title": "Featured Educational Programs",
    "description": "Safwa Schools offer a range of distinguished educational programs that combine quality, knowledge, and practical skills to prepare future leaders.",
    "all_programs": "All Programs",
    "bachelor": "Elementary Stage",
    "master": "Intermediate Stage",
    "certificates": "Secondary Stage",
    "computer_science": "Sciences and Mathematics",
    "computer_science_alt": "Sciences and Mathematics",
    "business_management": "Arabic and English Languages",
    "business_management_alt": "Arabic and English Languages",
    "medical_sciences": "Social Sciences",
    "medical_sciences_alt": "Social Sciences",
    "environmental_studies": "Islamic Education",
    "environmental_studies_alt": "Islamic Education",
    "mechanical_engineering": "Sports Activities",
    "mechanical_engineering_alt": "Sports Activities",
    "data_analysis": "Artistic Activities",
    "data_analysis_alt": "Artistic Activities",
    "years": "years",
    "hours": "hours",
    "semesters": "semesters",
    "spring_only": "spring only",
    "year_round": "year-round",
    "months": "months",
    "computer_science_desc": "A program focused on sciences and mathematics to develop logical thinking and scientific analysis skills among students.",
    "business_management_desc": "A program that develops Arabic and English language skills to enable students to communicate effectively and express themselves.",
    "medical_sciences_desc": "An integrated program in social sciences that helps students understand society and interact with it positively.",
    "environmental_studies_desc": "A program focused on Islamic education and instilling values and moral principles in students.",
    "mechanical_engineering_desc": "A program that develops sports and physical skills and enhances team spirit and fair competition.",
    "data_analysis_desc": "A program focused on artistic and creative activities to develop talents and creativity among students.",
    "learn_more": "Learn More"
  },
  "history": {
    "about_university": "About the Schools",
    "title": "Vision, Mission & Goals",
    "description": "Safwat Al Safwa Schools are committed to providing high-quality education to graduate distinguished students who compete with students from the finest schools. We focus on interactive, self-directed, and collaborative learning, scientific research, and training to establish knowledge. We provide continuous education for students and interested community members to keep pace with rapid changes for self-development and efficiency enhancement.",
    "founding_2015": "Establishment of Safwat Al Safwa Schools as one of the leading schools in Saudi Arabia",
    "opening_2018": "Opening the first academic stages and starting educational programs in various stages",
    "graduate_2020": "Launching advanced educational programs and development activities in various stages",
    "expansion_2023": "Schools expansion and opening new branches and advanced educational programs",
    "campus_alt": "School Campus",
    "mission": "Mission",
    "mission_text": "To cultivate and develop good character and self-confidence, and provide high-quality education with practical application to equip students with scientific and practical tools before graduation to produce distinguished students. To promote creativity in finding innovative solutions to current and expected challenges, provide distinguished research that contributes to sustainable development, protect human rights, and enhance knowledge exchange with specialized schools and institutions.",
    "vision": "Vision",
    "vision_text": "To provide high-quality education, continuous updating of curricula to match scientific progress, provide continuous education opportunities for students and interested community members to keep pace with rapid scientific development and rehabilitation to meet current and future labor market needs, provide an inspiring and innovative educational environment, focus on interactive, self-directed, and collaborative learning methods and scientific research to establish knowledge, enhance distance learning to obtain scientific material at the appropriate time and reduce study costs, horizontal and vertical integration of curricula, study by semester system to accommodate different capabilities and abilities of each student, conduct research and practical studies to solve current and expected challenges, graduate highly qualified students with insightful vision in various school specializations to be future leaders, respect others' ideas and beliefs, evaluate practical experiences, contribute to community service, prepare future leaders, support sustainable development, and cooperate with specialized schools and institutions internationally.",
    "goals": "Goals",
    "goals_text": "To qualify students to become specialists in their field, support scientific research and innovation in various fields, enhance knowledge and understanding in various scientific fields, and contribute to community development.",
    "university_highlights": "Schools Highlights",
    "accreditation": "Accredited Academic Programs",
    "diverse_students": "Students from Various Nationalities",
    "modern_curriculum": "Modern Curriculum",
    "international_partnerships": "Strong International Partnerships",
    "core_values": "Core Values",
    "academic_excellence": "Academic Excellence",
    "academic_excellence_text": "Striving to achieve excellence in education and promote scientific research",
    "community_participation": "Community Participation",
    "community_participation_text": "Effective contribution to community development and preparing future leaders",
    "innovation": "Innovation",
    "innovation_text": "Promoting creative thinking to find practical solutions to challenges",
    "global_vision": "Global Vision",
    "global_vision_text": "Cooperation with specialized schools and institutions internationally"
  },
  "institutes": {
    "title": "Educational Stages",
    "description": "We begin from the age of four and the stage is divided into two phases: the Foundation Phase and the Upper Elementary Phase.",
    "institutes_title": "Educational Stages",
    "elementary_institute": "Elementary Stage",
    "elementary_description": "The elementary stage starts from the age of four and is divided into two phases. The Foundation Phase includes six academic levels based on guided learning with the aim of teaching: good morals and human behavior, reading and writing, arithmetic, Tajweed, and basic computer skills. The Upper Elementary Phase includes six academic levels based on interactive, self, and cooperative learning, and scientific research with the aim of teaching the fundamentals of: Arabic language, science, mathematics, religious studies, computer studies, geography, history, and English (optional subject).",
    "middle_institute": "Middle School Stage",
    "middle_description": "The middle school stage consists of six academic levels and adopts interactive, self, and cooperative learning as well as scientific research. Its goal is to expand students’ knowledge in the various sciences they studied in elementary school in addition to introducing applied sciences.",
    "high_institute": "High School Stage",
    "high_description": "The high school stage consists of six academic levels and concludes when the student reaches the age of fifteen. It adopts interactive, self, and cooperative learning as well as scientific research. It focuses on preparing students for a college education that suits their abilities or teaching a profession to qualify them to join the job market if they do not wish to pursue university studies.",
    "institute_goals": "Stage Goals:",
    "available_subjects": "Academic Fields:",
    "elementary_goals": [
      "Develop reading, writing, speaking, and listening skills",
      "Enhance self-confidence and independence",
      "Instill core moral values and ethics",
      "Use modern interactive teaching methods"
    ],
    "middle_goals": [
      "Connect academic knowledge with practical skills",
      "Enhance critical and creative thinking",
      "Prepare students for high school and university",
      "Develop teamwork and collaboration skills"
    ],
    "high_goals": [
      "Prepare students for university and the job market",
      "Develop practical and technical skills",
      "Enhance scientific research and problem-solving",
      "Develop leadership and effective communication skills"
    ],
    "elementary_subjects": [
      "Arabic Language and Reading",
      "Basic Mathematics",
      "Natural Sciences",
      "Islamic Education and Values",
      "Arts and Creative Expression",
      "Physical Education"
    ],
    "middle_subjects": [
      "Arabic and English Language",
      "Advanced Mathematics",
      "Applied Sciences",
      "Artistic and Practical Activities",
      "Communication and Teamwork Skills"
    ],
    "high_subjects": [
      "Advanced Mathematics and Sciences",
      "Foreign Languages",
      "Technical and Vocational Skills",
      "Citizenship and Social Values",
      "Research Activities and Innovation",
      "Sports and Physical Education"
    ]
  },
  "mission_goals": {
    "title": "Mission & Goals",
    "description": "We are committed to a clear mission and specific goals to achieve excellence in education and scientific research",
    "mission": "Mission",
    "goals": "Goals",
    "mission_items": [
      "Cultivate and develop good character",
      "Cultivate and develop self-confidence",
      "Provide high-quality education and practical application to equip students with scientific and practical tools",
      "Promote creativity to find innovative solutions to current and expected challenges",
      "Provide distinguished research that contributes to sustainable development",
      "Protect human rights",
      "Promote knowledge exchange with specialized schools and institutions"
    ],
    "goals_items": [
      "Qualify students to become specialists in their fields",
      "Support scientific research and innovation in various fields",
      "Promote knowledge and understanding in various scientific fields",
      "Contribute to community development",
      "Prepare future leaders",
      "Support sustainable development",
      "Cooperate with specialized schools and institutions"
    ]
  },
  "principles": {
    "title": "Principles & Values",
    "description": "We are committed to a set of principles and values that govern our work and guide our vision towards excellence",
    "principles": "Principles",
    "values": "Values",
    "principles_items": [
      "Cultivate and develop good character",
      "Promote respect for human rights",
      "Prohibit all forms of discrimination",
      "Promote mutual respect between faculty, students, and staff",
      "Enhance interpersonal skills",
      "Encourage teamwork",
      "Self-accountability, evaluation, responsibility, and assessment"
    ],
    "values_items": [
      "Strive to achieve excellence in education",
      "Promote transparency and accountability in all transactions",
      "Promote scientific research",
      "Support publication of peer-reviewed scientific research",
      "Active participation",
      "Respect data privacy and confidentiality",
      "Promote creative thinking to find practical solutions to present and future challenges"
    ]
  },
  "recent_news": {
    "title": "Recent News",
    "description": "Follow the latest news, events, and activities at Safwa Schools",
    "events": "Events",
    "scholarships": "Scholarships",
    "education": "Education",
    "anniversary_celebration": "Schools Celebrate 10th Anniversary",
    "anniversary_description": "Safwat Al-Safwa Schools celebrated their 10th anniversary with the presence of senior officials and academics. The celebration witnessed the honoring of outstanding students and distinguished faculty members, in addition to announcing new development projects aimed at enhancing educational and research quality.",
    "anniversary_date": "September 15, 2025",
    "scholarship_program": "Launch of New Scholarship Program",
    "scholarship_description": "The schools announced the launch of a comprehensive scholarship program targeting outstanding students from various academic levels. The program covers full tuition fees in addition to a monthly stipend and free study materials for eligible students.",
    "scholarship_date": "September 10, 2025",
    "lab_opening": "Opening of Advanced Scientific Laboratories",
    "lab_description": "A group of advanced scientific laboratories was opened in various stages, equipped with the latest technologies and scientific equipment to provide an excellent educational and research environment for students and faculty members.",
    "lab_date": "September 5, 2025"
  },
  "remote_learning": {
    "title": "Remote Learning",
    "description": "Enables students from different geographical areas to learn through modern educational means; providing flexible educational opportunities for everyone at a pace that suits their individual needs",
    "learning_types": "Types of Learning",
    "synchronous_learning": "Synchronous Learning",
    "asynchronous_learning": "Asynchronous Learning",
    "advantages_benefits": "Advantages & Benefits",
    "synchronous_description": "Interactive live lectures through virtual classrooms via the internet",
    "asynchronous_description": "Pre-recorded lectures that allow students to access them at the appropriate time for each student and participate in discussions",
    "benefits_description": "Remote learning encourages self-directed and collaborative learning without the need to be present in traditional classrooms",
    "synchronous_features": "Synchronous Learning Features:",
    "asynchronous_features": "Asynchronous Learning Features:",
    "general_benefits": "General Benefits:",
    "tools_used": "Tools Used:",
    "learning_materials": "Learning Materials:",
    "available_fields": "Available Fields:",
    "synchronous_features_list": [
      "No need to travel to school",
      "Saves time and reduces study costs",
      "Direct interaction with teacher and colleagues",
      "Ability to ask questions and get immediate answers",
      "Screen and material sharing",
      "Recording lectures for later review"
    ],
    "asynchronous_features_list": [
      "Student studies at their convenient time",
      "Review lectures as needed to enhance understanding",
      "Complete flexibility in study scheduling",
      "Ability to pause and replay as needed",
      "Saves time and effort in commuting",
      "Ability to study from anywhere"
    ],
    "general_benefits_list": [
      "Reduces costs associated with traditional education such as travel and accommodation",
      "Provides flexible educational opportunities for everyone",
      "Encourages self-directed and collaborative learning",
      "Enables access to education from anywhere in the world",
      "Suitable for different learning styles",
      "Provides a comfortable and suitable learning environment"
    ],
    "tools_list": [
      "Interactive virtual classrooms",
      "Video conferences",
      "Digital interactive boards",
      "Learning management systems",
      "Direct assessment tools",
      "Communication platforms"
    ],
    "materials_list": [
      "Recorded videos",
      "Interactive presentations",
      "Audio files",
      "E-books",
      "Self-assessments",
      "Discussion forums"
    ],
    "fields_list": [
      "Educational Programs",
      "Training Courses",
      "Professional Certificates",
      "Professional Development Programs",
      "Advanced Studies",
      "Specialized Programs"
    ]
  },
  "research_center": {
    "title": "Research and Studies Center",
    "description": "The center has created the first beacon for a better tomorrow for what the individual and society should be to contribute to achieving security, peace, and sustainable development in 246 volumes",
    "center_sections": "Center Sections",
    "scientific_research": "Scientific Research",
    "specialized_studies": "Specialized Studies",
    "scientific_publication": "Scientific Publication",
    "scientific_research_description": "The center conducts more research and studies to achieve the schools' goals in various scientific and academic fields",
    "specialized_studies_description": "We provide specialized studies in various fields to achieve security, peace, and sustainable development in society",
    "scientific_publication_description": "Publishing research and studies in 246 volumes to be a beacon of science and knowledge in various fields",
    "research_goals": "Research Goals:",
    "studies_goals": "Study Goals:",
    "publication_goals": "Publication Goals:",
    "research_fields": "Research Fields:",
    "study_types": "Types of Studies:",
    "center_publications": "Center Publications:",
    "research_goals_list": [
      "Produce distinguished scientific research that contributes to sustainable development",
      "Support researchers and academics in various specializations",
      "Develop scientific and technical knowledge",
      "Contribute to solving societal problems",
      "Enhance research cooperation with local and international institutions"
    ],
    "studies_goals_list": [
      "Conduct in-depth studies on societal issues",
      "Develop sustainable development strategies",
      "Analyze trends and future challenges",
      "Provide recommendations and practical solutions",
      "Support decision-making in institutions"
    ],
    "publication_goals_list": [
      "Publish scientific and academic knowledge",
      "Make research available to researchers and interested parties",
      "Develop the Arabic scientific library",
      "Enhance scientific and knowledge exchange",
      "Contribute to building a knowledge society"
    ],
    "research_fields_list": [
      "Medical and Health Sciences",
      "Engineering and Technical Sciences",
      "Humanities and Social Sciences",
      "Administrative and Economic Sciences",
      "Islamic and Religious Sciences",
      "Applied Sciences"
    ],
    "study_types_list": [
      "Strategic Studies",
      "Economic Feasibility Studies",
      "Social Studies",
      "Human Development Studies",
      "Environmental Studies",
      "Technology Studies"
    ],
    "publications_list": [
      "Peer-Reviewed Scientific Journals",
      "Books and Scientific References",
      "Research Reports",
      "Scientific Papers",
      "Exploratory Studies",
      "Electronic Publications"
    ]
  },
  "stats": {
    "title": "Schools Statistics",
    "description": "The schools provide a leading educational experience that combines quality, knowledge, and scientific research, with an academic environment that stimulates creativity and innovation to serve society locally and internationally.",
    "learn_more": "Learn More",
    "virtual_tour": "Virtual Tour",
    "academic_programs": "Educational Programs",
    "research_funding": "Funded Research Projects"
  },
  "vision": {
    "title": "Our Vision",
    "description": "We strive to achieve a comprehensive vision that places Safwat Al-Safwa Schools at the forefront",
    "basic_vision": "Basic Vision",
    "basic_vision_text": "Providing high-quality education with continuous updating of curricula to match scientific progress",
    "continuous_education": "Continuous Education",
    "continuous_education_text": "Providing continuous education opportunities for students and interested community members to keep pace with rapid scientific development",
    "educational_environment": "Educational Environment",
    "educational_environment_text": "Providing an inspiring and innovative educational environment with a focus on interactive, self-directed, and collaborative learning",
    "distance_learning": "Distance Learning",
    "distance_learning_text": "Enhancing distance learning to obtain scientific material at the appropriate time and reduce study costs",
    "academic_integration": "Academic Integration",
    "academic_integration_text": "Horizontal and vertical integration of curricula with semester-based study system",
    "scientific_research": "Scientific Research",
    "scientific_research_text": "Conducting practical research and studies to solve current and expected challenges",
    "leadership_preparation": "Leadership Preparation",
    "leadership_preparation_text": "Graduating highly qualified students with insightful vision in various school specializations",
    "international_cooperation": "International Cooperation",
    "international_cooperation_text": "Cooperation with specialized schools and institutions with establishing strong international partnerships"
  },
  "faculty": {
    "title": "Faculty",
    "description": "Learn about the faculty that provides education at the schools",
    "faculties_title": "Faculty",
    "faculty_goals": "Faculty Goals:",
    "available_specialties": "Available Specialties:",
    "faculty_departments": "Faculty Departments:",
    "medicine": {
      "name": "Faculty of Medicine",
      "description": "Aims to provide high-quality medical education, training, and practical experience before graduation for students to become qualified to provide distinguished medical services and take responsibility for their mistakes.",
      "goals": [
        "Provide high-quality medical education, training, and practical experience",
        "Support medical research and innovation",
        "Contribute to providing distinguished healthcare"
      ],
      "specialties": [
        "Internal Medicine",
        "General Surgery",
        "Pediatrics",
        "Obstetrics and Gynecology",
        "Ophthalmology",
        "Cardiology",
        "Neurology",
        "Dermatology",
        "Ear, Nose and Throat",
        "Orthopedics"
      ]
    },
    "dentistry": {
      "name": "Faculty of Oral and Dental Medicine",
      "description": "Aims to provide high-quality education in oral and dental medicine, training, and practical application before graduation for students to become qualified to provide distinguished oral and dental healthcare services.",
      "goals": [
        "Provide high-quality education in oral and dental medicine",
        "Support scientific research and innovation in oral and dental medicine",
        "Contribute to providing oral and dental healthcare"
      ],
      "specialties": [
        "Oral and Maxillofacial Surgery",
        "Orthodontics",
        "Pediatric Dentistry",
        "Dental Implants",
        "Endodontics",
        "Cosmetic Dentistry",
        "Periodontics",
        "Preventive Dentistry",
        "Prosthodontics",
        "Forensic Dentistry",
        "Laser Dentistry",
        "Digital Dentistry",
        "Geriatric Dentistry",
        "Sports Dentistry",
        "Veterinary Dentistry",
        "Dental Radiology",
        "Restorative Dentistry",
        "Advanced Cosmetic Dentistry",
        "Neuro-Dentistry",
        "Genetic Dentistry"
      ]
    },
    "medical_sciences": {
      "name": "Faculty of Medical Sciences",
      "description": "Aims to provide high-quality education in medical sciences fields, training, and practical experience before graduation for students to become distinguished specialists in their medical fields.",
      "goals": [
        "Provide high-quality education in medical sciences fields",
        "Support scientific research and innovation in medical sciences",
        "Contribute to providing distinguished healthcare"
      ],
      "departments": [
        "Nursing Department",
        "Physical Therapy Department",
        "Medical Laboratories Department",
        "Radiology Department",
        "Therapeutic Nutrition Department",
        "Public Health Department"
      ]
    },
    "engineering": {
      "name": "Faculty of Engineering",
      "description": "Aims to provide high-quality engineering education, training, and practical experience before graduation for students to meet labor market needs.",
      "goals": [
        "Provide high-quality engineering education, training, and practical experience",
        "Support scientific research and innovation in engineering fields",
        "Contribute to community development and improving quality of life"
      ],
      "departments": [
        "Civil Engineering Department",
        "Architecture Department",
        "Electrical Engineering Department",
        "Computer Engineering Department",
        "Mechanical Engineering Department",
        "Chemical Engineering Department",
        "Petroleum Engineering Department",
        "Industrial Engineering Department"
      ]
    },
    "management": {
      "name": "Faculty of Management",
      "description": "Aims to provide high-quality education in business administration and accounting fields, training, and practical experience before graduation for students in companies and institutions to meet labor market needs.",
      "goals": [
        "Provide high-quality education in business administration and accounting fields",
        "Develop leadership, management, and accounting skills among students",
        "Contribute to community development and improving quality of life"
      ],
      "departments": [
        "Business Administration Department",
        "Accounting Department",
        "Marketing Department",
        "Finance Department",
        "Human Resources Department",
        "Management Information Systems Department"
      ]
    },
    "law": {
      "name": "Faculty of Law",
      "description": "Aims to provide high-quality education in human rights and law fields, training, and practical experience before graduation for students to become qualified to work in the judiciary, as lawyers, or consultants.",
      "goals": [
        "Provide high-quality education in human rights and law fields",
        "Develop legal knowledge and deep understanding of laws and regulations",
        "Contribute to achieving justice through applying legal knowledge"
      ],
      "specialties": [
        "Civil Law",
        "Criminal Law",
        "Commercial Law",
        "Administrative Law",
        "Constitutional Law",
        "International Law",
        "Labor Law",
        "Family Law"
      ]
    },
    "humanities": {
      "name": "Faculty of Humanities",
      "description": "Aims to provide high-quality education in advocacy and media fields, training, and practical experience before graduation for students to qualify them to understand and analyze human and cultural phenomena.",
      "goals": [
        "Provide high-quality education in advocacy and media fields",
        "Contribute to community development and improving quality of life"
      ],
      "departments": [
        "Advocacy Department",
        "Media Department",
        "Philosophy Department",
        "History Department",
        "Psychology Department",
        "Sociology Department"
      ]
    },
    "community_development": {
      "name": "Faculty of Community Development",
      "description": "Aims to provide high-quality education in community development and social work fields, training, and practical experience before graduation for students to qualify them to become specialists in community development and social work.",
      "goals": [
        "Provide high-quality education in community development and social work fields",
        "Contribute to community development and improving quality of life"
      ],
      "specialties": [
        "Social Work",
        "Local Community Development",
        "Sustainable Development",
        "Non-Profit Organization Management",
        "Rural Development",
        "Urban Development"
      ]
    },
    "computer_science": {
      "name": "Faculty of Computer Science and Information Systems",
      "description": "Aims to provide high-quality education in computer science and information technology fields, training, and practical experience before graduation for students to qualify them to become specialists in software design and development and information systems.",
      "goals": [
        "Provide high-quality education in computer science and information technology fields",
        "Qualify students to become specialists in software design and development"
      ],
      "specialties": [
        "Computer Science",
        "Software Engineering",
        "Information Systems",
        "Information Security",
        "Artificial Intelligence",
        "Web Development",
        "Database Systems",
        "Networking"
      ]
    },
    "languages_translation": {
      "name": "Faculty of Languages and Translation",
      "description": "Aims to provide high-quality education in languages and translation fields, training, and practical experience before graduation to qualify them to become experts in languages and translation.",
      "goals": [
        "Provide high-quality education in languages and translation fields",
        "Develop linguistic knowledge and deep understanding of languages and cultures",
        "Contribute to facilitating linguistic communication between different cultures"
      ],
      "specialties": [
        "Written Translation",
        "Oral Translation",
        "Simultaneous Translation",
        "Literary Translation",
        "Technical Translation",
        "English Language",
        "French Language",
        "German Language"
      ]
    }
  },
  "breadcrumb": {
    "home": "Home"
  },
  "admissions": {
    "main_title": "Start Your Educational Journey Today",
    "main_description": "Safwat Al Safwa Schools are committed to providing high-quality education to graduate distinguished students who compete with students from the finest schools. We focus on interactive, self-directed, and collaborative learning, scientific research, and training to establish knowledge.",
    "how_to_apply": "How to Apply",
    "steps": {
      "step1": {
        "title": "Submit Application",
        "description": "Fill out the online application form and submit all required documents through the schools website"
      },
      "step2": {
        "title": "Submit Documents",
        "description": "Send all required documents such as academic certificates, ID photos, and personal photos"
      },
      "step3": {
        "title": "Personal Interview",
        "description": "You will be invited for a personal interview with the admissions committee to evaluate your abilities and academic qualifications"
      },
      "step4": {
        "title": "Receive Decision",
        "description": "You will receive notification of the admission or rejection decision via email or text messages"
      }
    },
    "important_dates": "Important Admission Deadlines",
    "deadlines": {
      "semester1": "First Semester",
      "semester2": "Second Semester",
      "summer": "Summer Semester",
      "early_admission": "Early Admission"
    },
    "dates": {
      "march_15": "March 15, 2024",
      "october_1": "October 1, 2024",
      "january_30": "January 30, 2025",
      "november_15": "November 15, 2024"
    },
    "requirements": "Admission Requirements",
    "requirements_list": {
      "academic_records": {
        "title": "Academic Records",
        "description": "Previous stage certificate or equivalent with official transcript"
      },
      "recommendation_letters": {
        "title": "Recommendation Letters",
        "description": "Two recommendation letters from previous teachers or academic supervisors"
      },
      "personal_statement": {
        "title": "Personal Statement",
        "description": "Write a personal statement explaining your academic and professional goals and reasons for choosing the schools"
      },
      "standardized_tests": {
        "title": "Standardized Tests",
        "description": "Results of standardized tests or English language tests according to the required stage"
      }
    },
    "request_info": {
      "title": "Request Information",
      "description": "Do you have questions about the admission process or available programs? Contact us for more information",
      "form": {
        "name_placeholder": "Full Name",
        "email_placeholder": "Email Address",
        "phone_placeholder": "Phone Number",
        "program_placeholder": "Desired Stage",
        "message_placeholder": "Questions or Comments",
        "submit_button": "Submit Request",
        "programs": {
          "bachelor": "Elementary Stage",
          "master": "Intermediate Stage",
          "phd": "Secondary Stage",
          "diploma": "Remote Learning"
        }
      }
    },
    "cta": {
      "campus_visit": {
        "title": "School Visit",
        "description": "Learn about the schools facilities and distinguished learning environment through a school visit",
        "button": "Book Visit"
      },
      "ready_to_apply": {
        "title": "Ready to Apply?",
        "description": "Start your educational journey with Safwat Al Safwa Schools and be part of our distinguished community",
        "button": "Start Application"
      }
    }
  },
  "page_titles": {
    "about": {
      "title": "About Schools",
      "description": "High-quality education starts with excellent curricula, management, and teachers. At Safwat Al-Safwa Schools, we ensure modern curricula and employ a selection of highly experienced educational professionals, focusing on nurturing values, ethics, and effective training.",
      "current_page": "About Schools"
    },
    "admissions": {
      "title": "Admissions & Registration",
      "description": "Start your educational journey with Safwat Al-Safwa Schools and discover the distinguished educational opportunities available to you",
      "current_page": "Admissions"
    },
    "faculty": {
      "title": "Faculty",
      "description": "Learn about the faculty that provides education at the schools",
      "current_page": "Faculty"
    },
    "institutes": {
      "title": "Academic Levels",
      "description": "Discover the specialized academic levels at Safwat Al-Safwa Schools",
      "current_page": "Academic Levels"
    },
    "contact": {
      "title": "Contact Us",
      "description": "We are here to help you with any inquiry or request",
      "current_page": "Contact Us"
    },
    "login": {
      "title": "Login",
      "description": "Sign in to your account to access electronic services",
      "current_page": "Login"
    },
    "admissions": {
      "title": "Admissions & Registration",
      "description": "Learn how to apply to the schools and important admission deadlines",
      "current_page": "Admissions"
    },
    "remote_learning": {
      "title": "Remote Learning",
      "description": "Enables students from different geographical areas to learn through modern educational means; providing flexible educational opportunities for everyone",
      "current_page": "Remote Learning"
    },
    "research_center": {
      "title": "Research & Studies Center",
      "description": "The center has created the first beacon for a better tomorrow for what the individual and society should be to contribute to achieving security, peace, and sustainable development in 246 volumes",
      "current_page": "Research Center"
    },
    "privacy": {
      "title": "Privacy Policy",
      "description": "Learn about the schools' privacy policy",
      "current_page": "Privacy Policy"
    },
    "terms_of_service": {
      "title": "Terms & Conditions",
      "description": "Learn about the schools' terms and conditions",
      "current_page": "Terms & Conditions"
    },
    "error_page": {
      "title": "Page Not Found",
      "description": "The page you are looking for may have been deleted, renamed, or temporarily unavailable",
      "current_page": "Error 404"
    }
  }
}